[
    {
        "title": "Kasa",
        "presentation": "Agence de location d'appartements entre particuliers depuis près de 10 ans, un des leaders du marché en France.",
        "description": "Refonte du site web Kasa avec une stack JS plus récente utilisant React et Node.js.",
        "objectif": "J'ai été recruté par l'entreprise Kasa en tant que développeur front-end freelance pour développer leur nouvelle plateforme web. En effet, le site ayant été codé il y a 10 ans, la CTO souhaitait le mettre à jour avec une stack complète en JS plus récente. J'avais donc pour objectif de développer l'ensemble de l'application en modernisant la plateforme, d'offrir une meilleure expérience utilisateur sur différentes tailles d'écrans, tout en restant le plus fidèle possible aux maquettes fournies.",
        "techno": [
            "React",
            "Node",
            "Sass",
            "Responsive Web Design",
            "Figma"
        ],
        "repo": "https://github.com/AlexDDevv/P8-Kasa",
        "website": "https://p8-kasa-sigma.vercel.app/",
        "cover": "./assets/img/Kasa.webp"
    },
    {
        "title": "Sophie Bluel",
        "presentation": "Agence web ArchiWebos travaillant sur la conception du site portfolio d'une architecte d'intérieur.",
        "description": "Conception du site portfolio d'une architecte d'intérieur.",
        "objectif": "Travaillant comme développeur front-end pour l'agence, j'ai aidé l'équipe s'occupant de ce projet en étant chargé de développer plusieurs fonctionnalités importantes du site. Je devais notamment créer la page de présentation des travaux de l'architecte avec un système de filtre par catégories, la page de connexion sécurisée de l'administrateur, et d'une fenêtre modale pour ajouter et/ou supprimer un projet dans la galerie de présentation. Le tout a été généré dynamiquement avec Javascript et en communiquant avec une API",
        "techno": [
            "HTML 5",
            "CSS 3",
            "Javascript",
            "Node.js",
            "Swagger",
            "Figma"
        ],
        "repo": "https://github.com/AlexDDevv/P6-Portefolio-Sophie-Bluel",
        "cover": "./assets/img/Sophie-Bluel.webp"
    },
    {
        "title": "OhMyFood",
        "presentation": "Jeune startup présente à New York, souhaite faire sa place à Paris et s'imposer sur le marché de la restauration.",
        "description": "Site répertoriant les menus de restaurants gastronomiques.",
        "objectif": "J'ai intégré cette startup en tant que développeur junior, et je devais créer le site à l'aide des maquettes fournies par l'équipe UX designer. J'ai conçu le projet en 'mobile first', c'est à dire prioriser et optimiser l'expérience utilisateur sur les appareils mobiles, en garantissant une expérience fluide et réactive sur tout type d'appareil. Pour améliorer l'intéractivité du site, j'ai intégré plusieurs animations fluides et naturelles, rendant une immersion et une utilisation agréable du site.",
        "techno": [
            "HTML 5",
            "Sass",
            "Animations css",
            "Responsive Web Design"
        ],
        "repo": "https://github.com/AlexDDevv/P4-OhMyFood",
        "website": "https://p4-oh-my-food.vercel.app/",
        "cover": "./assets/img/OhMyFood.webp"
    }
]