[
    {
        "id": 1,
        "title": "My little Library",
        "presentation": "Bibliothèque numérique permettant de chercher des livres, d'enregistrer ceux que l'on a déjà lu ou que l'on souhaite lire.",
        "description": "Petite bibliothèque numérique pour enregistrer des livres à lire ou déjà lus.",
        "objectif": "Aimant beaucoup lire, j'ai souhaité créer un projet autour de la lecture, qui pourrait me servir à garder une trace de tous les livres que j'ai lu ou d'avoir une liste de ceux que j'aimerais lire. J'ai mis à contribution les compétences que j'ai acquises durant ma formation, notamment React. J'ai utilisé l'API Google Books pour récupérer les données. Ce projet m'a aussi permis de travailler ma créativité, ayant fait le design moi-même. Plusieurs fonctionnalités seront rajoutées dans le futur.",
        "techno": [
            "React",
            "Sass",
            "Google API",
            "Responsive Web Design",
            "Design"
        ],
        "repo": "https://github.com/AlexDDevv/My-library",
        "website": "https://my-little-library.vercel.app/",
        "cover": "/MyLittleLibrary.webp"
    },
    {
        "id": 2,
        "title": "Kasa",
        "presentation": "Agence de location d'appartements entre particuliers depuis près de 10 ans, un des leaders du marché en France.",
        "description": "Refonte du site web Kasa avec une stack JS plus récente utilisant React et Node.js.",
        "objectif": "J'ai été recruté par l'entreprise Kasa en tant que développeur front-end freelance pour développer leur nouvelle plateforme web. En effet, le site ayant été codé il y a 10 ans, la CTO souhaitait le mettre à jour avec une stack complète en JS plus récente. J'avais donc pour objectif de développer l'ensemble de l'application en modernisant la plateforme, d'offrir une meilleure expérience utilisateur sur différentes tailles d'écrans, tout en restant le plus fidèle possible aux maquettes fournies.",
        "techno": [
            "React",
            "Node",
            "Sass",
            "Responsive Web Design",
            "Figma"
        ],
        "repo": "https://github.com/AlexDDevv/P8-Kasa",
        "website": "https://p8-kasa-sigma.vercel.app/",
        "cover": "/Kasa.webp"
    },
    {
        "id": 3,
        "title": "Sophie Bluel",
        "presentation": "Agence web ArchiWebos travaillant sur la conception du site portfolio d'une architecte d'intérieur.",
        "description": "Conception du site portfolio d'une architecte d'intérieur.",
        "objectif": "Travaillant comme développeur front-end pour l'agence, j'ai aidé l'équipe s'occupant de ce projet en étant chargé de développer plusieurs fonctionnalités importantes du site. Je devais notamment créer la page de présentation des travaux de l'architecte avec un système de filtre par catégories, la page de connexion sécurisée de l'administrateur, et d'une fenêtre modale pour ajouter et/ou supprimer un projet dans la galerie de présentation. Le tout a été généré dynamiquement avec Javascript et en communiquant avec une API",
        "techno": [
            "HTML 5",
            "CSS 3",
            "Javascript",
            "Node.js",
            "Swagger",
            "Figma"
        ],
        "repo": "https://github.com/AlexDDevv/P6-Portefolio-Sophie-Bluel",
        "cover": "/Sophie-Bluel.webp"
    }
]